<a href="https://colab.research.google.com/github/LaetitiaVerel/Odyssey-Quests/blob/master/Laetitia_VEREL_Pandas_Part_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Mission 1

![](https://i.imgur.com/Ax3pp2A.png)


Creates a "fruit" dataframe that reproduces the above image using a list

In [ ]:
import pandas as pd

Apples = [30]
Bananas = [21]

fruit = pd.DataFrame(list(zip(Apples, Bananas)), 
               columns =['Apples', 'Bananas']) 
print(fruit)

   Apples  Bananas
0      30       21

# Mission 2

Creates a "fruits_vendus" dataframe that reproduces the image below using a dictionary

![](https://i.imgur.com/CHPn7ZF.png)

In [ ]:
fruits_vendus = {'2017 Sales': [35, 21], '2018 Sales': [41, 34]}
pd.DataFrame.from_dict(fruits_vendus, orient='index', columns=['Apples', 'Bananas'])

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

# Mission 3

Renames the column names in the Mission 2 dataframe in French (Apples = Pommes ; Bananas = Bananes)

In [ ]:
data = {'2017 Sales': [35, 21], '2018 Sales': [41, 34]}
fruits_vendus = pd.DataFrame.from_dict(data, orient='index', columns=['Apples', 'Bananas'])
print(fruits_vendus)

fruits_vendus_fr = fruits_vendus.rename(columns={'Apples': 'Pommes', 'Bananas': 'Bananes'})
print(fruits_vendus_fr)

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34
            Pommes  Bananes
2017 Sales      35       21
2018 Sales      41       34

# Mission 4

Uses a loop to display the mission 3 dataframe column values.

In [ ]:
# voir Mission 3
for (columnName, columnData) in fruits_vendus_fr.iteritems():
   print('Column Name : ', columnName)
   print('Column Contents : ', columnData.values)

Column Name :  Pommes
Column Contents :  [35 41]
Column Name :  Bananes
Column Contents :  [21 34]

# Mission 5

Deletes line 1 of the mission 3 dataframe

In [ ]:
fruits_vendus_fr.drop(fruits_vendus_fr.index[0])

            Pommes  Bananes
2018 Sales      41       34

# Mission 6

Deletes a column from the mission 3 dataframe.

In [ ]:
fruits_vendus_fr.drop('Pommes', axis=1)

            Bananes
2017 Sales       21
2018 Sales       34